Catalogs/АР_ПланировкиПомещенийИПлощадей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_ПланировкиПомещенийИПлощадей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьФайлШаблона</Name>
					<Comment>Файл шаблона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лист</Name>
					<Comment>Лист рабочей книги файла шаблона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрОбъект</Name>
					<Comment>Имя графического объекта на рабочем листе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПланировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ФайлыПланировокПомещенийИПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_ПланировкиПомещенийИПлощадей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем СписокЛистов;

&НаКлиенте
Перем Книга;

&НаКлиенте
Перем Excel;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура ОткрытьКнигу(Отказ)
	
	ИмяФайла = ИнтеграцияЕГАИСВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ФайлПланировки, "ИмяФайла");
	// Получить расширение файла.
	РасширениеФайла = Прав(ИмяФайла, 4);
	
	Если Лев(РасширениеФайла, 1) = "." Тогда
		// Получить имя временного файла. Установить расширение временного файла.
		РасширениеФайла = Прав(ИмяФайла, 3);
	КонецЕсли;
	
	Если ВРег(РасширениеФайла) <> "XLS" И  ВРег(РасширениеФайла) <> "XLSX" Тогда // Файл не является экселевским
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл шаблона не является файлом Excel");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ИмяФайла);
	Если Не Файл.Существует() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл """ + СокрЛП(ИмяФайла) + """ не существует!",,"Объект.ФайлШаблона");
		Отказ = Истина;
	Иначе
		Книга = Excel.Workbooks.Open(ИмяФайла,, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьСписокЛистов()
	
	СписокЛистов = Новый СписокЗначений;
	//Если Не ЗначениеЗаполнено(Объект.ФайлШаблона) Тогда
	Если Не ЗначениеЗаполнено(Объект.ФайлПланировки) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	Если Книга = Неопределено Тогда
		ОткрытьКнигу(Отказ);
		Если Отказ Тогда
			СписокЛистов = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если не Отказ Тогда
		Для Ном = 1 по Книга.Sheets().Count() Цикл
			СписокЛистов.Добавить(Книга.Sheets(Ном).Name);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ СВОЙСТВ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ГрОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Лист) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сперва необходимо выбрать лист";
		Сообщение.Поле = "Объект.Лист";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Попытка	
		Отказ = Ложь;
		Если Книга = Неопределено Тогда
			ОткрытьКнигу(Отказ);
		КонецЕсли;
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		СписокОбъектов = Новый СписокЗначений;
		План = Книга.Sheets(Объект.Лист);
		Для Ном = 1 по План.Shapes().Count() Цикл
			Если (План.Shapes(Ном).Type() = 5) ИЛИ 
				(План.Shapes(Ном).Type() = 1 И (План.Shapes(Ном).AutoShapeType < 105 
				ИЛИ План.Shapes(Ном).AutoShapeType > 108)) Тогда
				СписокОбъектов.Добавить(План.Shapes(Ном).Name);
			КонецЕсли;
		КонецЦикла;
		Если СписокОбъектов.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "На данном листе нет объектов для выбора";
			Сообщение.Поле = "Объект.Лист";
			Сообщение.Сообщить();
		Иначе
			ВыбЭлемент = СписокОбъектов.ВыбратьЭлемент("Выберите графический объект", ВыбЭлемент);
			Если ВыбЭлемент = Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Объект не выбран";
				Сообщение.Сообщить();
			Иначе
				Объект.ГрОбъект = ВыбЭлемент.Значение;
				Объект.ОбластьТекста = "";
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ГрОбъектОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отказ = Ложь;
	Если Книга = Неопределено Тогда
		ОткрытьКнигу(Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		Попытка
			// Сделаем невидимыми выноски и текст в надписях уберем
			План = Excel.Sheets(СокрЛП(Объект.Лист));
			Ном = 1;
			Пока Ном < План.Shapes().Count() + 1 Цикл
				ОбъектТекст = План.Shapes(Ном); 
				Если ОбъектТекст.Type = 1 Тогда
					ОбъектТекст.Line.Visible = Ложь;
					Попытка
						ОбъектТекст.TextEffect.Text = "";
					Исключение
						ОбъектТекст.OLEFormat.Object.Text = "";
					КонецПопытки;
				ИначеЕсли ОбъектТекст.Type = 17 Тогда
					ОбъектТекст.OLEFormat.Object.Text = "";
				КонецЕсли;
				Ном = Ном + 1;							
			КонецЦикла;
							
			// Заполним объекты по умолчанию
			Ном = 1;
			Пока Ном < План.Shapes().Count() + 1 Цикл
				ОбъектШаблона = План.Shapes(Ном); 
				Если ОбъектШаблона.Type = 5 Тогда
					ОбъектШаблона.Fill.Visible = -1;
					ОбъектШаблона.Fill.Solid();
					ОбъектШаблона.Fill.ForeColor.SchemeColor = 43;
					ОбъектШаблона.Fill.Transparency = 0.5;
					ОбъектШаблона.Line.Weight = 0.75;
					ОбъектШаблона.Line.DashStyle = 1;
					ОбъектШаблона.Line.Style = 1;
					ОбъектШаблона.Line.Transparency = 0;
					ОбъектШаблона.Line.Visible = -1;
					ОбъектШаблона.Line.ForeColor.SchemeColor = 64;
					ОбъектШаблона.Line.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
				КонецЕсли;
				Ном = Ном + 1;							
			КонецЦикла;
			
			Excel.sheets(СокрЛП(Объект.Лист)).Activate();
			
			//+са
			Если СокрЛП(Объект.Лист) = СокрЛП(Объект.ГрОбъект) Тогда
				ОбъектШаблона =Excel.Worksheets(Объект.ГрОбъект);
				//ОбъектШаблона = Excel.ActiveSheet(СокрЛП(Объект.ГрОбъект));
				ОбъектШаблона.Select();
				// Заштрихуем выделенный объект
				//Excel.Selection.ShapeRange.Line.Weight = 0.75;
				//Excel.Selection.ShapeRange.Line.DashStyle = 1;
				//Excel.Selection.ShapeRange.Line.Style = 1;
				//Excel.Selection.ShapeRange.Line.Transparency = 0;
				//Excel.Selection.ShapeRange.Line.Visible = -1;
				//Excel.Selection.ShapeRange.Line.ForeColor.SchemeColor = 64;
				//Excel.Selection.ShapeRange.Line.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
				//Excel.Selection.ShapeRange.Fill.Visible = -1;
				//Excel.Selection.ShapeRange.Fill.ForeColor.SchemeColor = 8;
				//Excel.Selection.ShapeRange.Fill.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
				//Excel.Selection.ShapeRange.Fill.Transparency = 0;
				//Excel.Selection.ShapeRange.Fill.Patterned(41);
				
				Excel.Visible=1;
			КонецЕсли;	
			//-са
			
			ОбъектШаблона = Excel.ActiveSheet.Shapes(СокрЛП(Объект.ГрОбъект));
			ОбъектШаблона.Select();
			// Заштрихуем выделенный объект
			Excel.Selection.ShapeRange.Line.Weight = 0.75;
			Excel.Selection.ShapeRange.Line.DashStyle = 1;
			Excel.Selection.ShapeRange.Line.Style = 1;
			Excel.Selection.ShapeRange.Line.Transparency = 0;
			Excel.Selection.ShapeRange.Line.Visible = -1;
			Excel.Selection.ShapeRange.Line.ForeColor.SchemeColor = 64;
			Excel.Selection.ShapeRange.Line.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
			Excel.Selection.ShapeRange.Fill.Visible = -1;
			Excel.Selection.ShapeRange.Fill.ForeColor.SchemeColor = 8;
			Excel.Selection.ShapeRange.Fill.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
			Excel.Selection.ShapeRange.Fill.Transparency = 0;
			Excel.Selection.ShapeRange.Fill.Patterned(41);
			
			Если ЗначениеЗаполнено(Объект.ОбластьТекста) Тогда
				ОбъектТекст = Excel.ActiveSheet.Shapes(СокрЛП(Объект.ОбластьТекста));
			Иначе
				ОбъектТекст = Excel.ActiveSheet.Shapes.AddTextbox(1, ОбъектШаблона.Left, ОбъектШаблона.Top, ОбъектШаблона.Width, ОбъектШаблона.Height);
			КонецЕсли;
			
			Текст = СокрЛП(Объект.Наименование);
			Попытка  // Это Excel 2007
				Если Не ЗначениеЗаполнено(Объект.ОбластьТекста) Тогда
					ОбъектТекст.TextEffect.FontName = "Arial CYR";
					ОбъектТекст.TextEffect.FontSize = 10;
					ОбъектТекст.TextEffect.FontBold = True;
				КонецЕсли;
				ОбъектТекст.TextEffect.Text = Текст;
				ОбъектТекст.Fill.Visible = Ложь;
				Если ОбъектТекст.Type = 1 И ОбъектТекст.AutoShapeType >= 105 И ОбъектТекст.AutoShapeType <= 108 Тогда
					ОбъектТекст.Line.Visible = Истина;
				Иначе
					ОбъектТекст.Line.Visible = Ложь;
				КонецЕсли;
			Исключение 
				Попытка // Это Excel 2003
					Если Не ЗначениеЗаполнено(Объект.ОбластьТекста) Тогда
						ОбъектТекст.OLEFormat.Object.Font.Name = "Arial CYR";
						ОбъектТекст.OLEFormat.Object.Font.Size = 10;
						ОбъектТекст.OLEFormat.Object.Font.Bold = True;
					КонецЕсли;
					ОбъектТекст.OLEFormat.Object.Text = Текст;
					ОбъектТекст.Fill.Visible = Ложь;
					Если ОбъектТекст.Type = 1 И ОбъектТекст.AutoShapeType >= 105 И ОбъектТекст.AutoShapeType <= 108 Тогда
						ОбъектТекст.Line.Visible = Истина;
					Иначе
						ОбъектТекст.Line.Visible = Ложь;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецПопытки;
			Excel.Visible=1;
		Исключение
			Возврат;
		КонецПопытки;
		#Если ВебКлиент Тогда
			ПолноеИмяФайла = "";
		#Иначе
			ПолноеИмяФайла = ПолучитьИмяВременногоФайла("xls");
		#КонецЕсли
		Книга.SaveAs(ПолноеИмяФайла);
		ОткрытьПросмотр = Вопрос("Для работы с файлом шаблона, перейдите в окно MS EXCEL",  РежимДиалогаВопрос.ОК);
		Книга = Неопределено;					
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если СписокЛистов = Неопределено Тогда
		ПрочитатьСписокЛистов();
	КонецЕсли;
	
	Попытка
		ВыбЭлемент = СписокЛистов.ВыбратьЭлемент("Выберите рабочий Лист", ВыбЭлемент);
		Если ВыбЭлемент = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Лист не выбран";
			Сообщение.Сообщить();
		Иначе
			Объект.Лист = ВыбЭлемент.Значение;
			Объект.ГрОбъект = "";
			Объект.ОбластьТекста = "";
			
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластьТекстаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Лист) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сперва необходимо выбрать лист";
		Сообщение.Поле = "Объект.Лист";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Попытка	
		Отказ = Ложь;
		Если Книга = Неопределено Тогда
			ОткрытьКнигу(Отказ);
		КонецЕсли;
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		СписокТекстбоксов = Новый СписокЗначений;
		План = Книга.Sheets(Объект.Лист);
		Для Ном = 1 по План.Shapes().Count() Цикл
			ОбъектТекст = План.Shapes(Ном); 
			Если ОбъектТекст.Type = 17 ИЛИ (ОбъектТекст.Type = 1 
				И ОбъектТекст.AutoShapeType >= 105 И ОбъектТекст.AutoShapeType <= 108) Тогда
				СписокТекстбоксов.Добавить(План.Shapes(Ном).Name);
			КонецЕсли;
		КонецЦикла;
		Если СписокТекстбоксов.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "На данном листе нет текстовых областей для выбора";
			Сообщение.Поле = "Объект.Лист";
			Сообщение.УстановитьДанные(ЭтаФорма);
			Сообщение.Сообщить();
		Иначе
			ВыбЭлемент = СписокТекстбоксов.ВыбратьЭлемент("Выберите текстовую область", ВыбЭлемент);
			Если ВыбЭлемент = Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Текстовая область не выбрана";
				Сообщение.Сообщить();
			Иначе
				Объект[Элемент.Имя] = ВыбЭлемент.Значение;
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Excel = Новый COMОбъект("Excel.Application");
	Книга = Неопределено;
	СписокЛистов = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
		
	Если Книга <> Неопределено Тогда
		Попытка
			Книга.Close(Ложь);
		Исключение
		КонецПопытки;
		Книга = Неопределено;		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ФайлПланировкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФайлВыполнить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлВыполнить()
	
	ПолноеИмяФайла = ИнтеграцияЕГАИСВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ФайлПланировки, "ИмяФайла");
	ЗапуститьПриложение(ПолноеИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлПланировкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = ПолучитьФорму("Справочник.АР_ФайлыПланировокПомещенийИПлощадей.Форма.ФормаВыбора",, Элемент);
	ФормаВыбора.Открыть();
	
КонецПроцедуры
